
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>什么是分布式版本控制系统（DVCS） · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="上手 1：新公司用 Git 管理代码，怎么快速上手？.html" />
    
    
    <link rel="prev" href="什么是版本控制系统VCS.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    前言
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="什么是版本控制系统VCS.html">
            
                <a href="什么是版本控制系统VCS.html">
            
                    
                    什么是版本控制系统（VCS）
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.3" data-path="什么是分布式版本控制系统DVCS.html">
            
                <a href="什么是分布式版本控制系统DVCS.html">
            
                    
                    什么是分布式版本控制系统（DVCS）
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="上手 1：新公司用 Git 管理代码，怎么快速上手？.html">
            
                <a href="上手 1：新公司用 Git 管理代码，怎么快速上手？.html">
            
                    
                    上手 1：新公司用 Git 管理代码，怎么快速上手？
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="上手 2：团队工作的基本工作模型.html">
            
                <a href="上手 2：团队工作的基本工作模型.html">
            
                    
                    上手 2：团队工作的基本工作模型
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="进阶 1：HEAD、master 与 branch.html">
            
                <a href="进阶 1：HEAD、master 与 branch.html">
            
                    
                    进阶 1：HEAD、master 与 branch
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="进阶 2：push 的本质.html">
            
                <a href="进阶 2：push 的本质.html">
            
                    
                    进阶 2：push 的本质
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="进阶 3：merge：合并 commits.html">
            
                <a href="进阶 3：merge：合并 commits.html">
            
                    
                    进阶 3：merge：合并 commits
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9" data-path="进阶 4：Feature Branching：最流行的工作流.html">
            
                <a href="进阶 4：Feature Branching：最流行的工作流.html">
            
                    
                    进阶 4：Feature Branching：最流行的工作流
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.10" data-path="进阶 5：关于 add.html">
            
                <a href="进阶 5：关于 add.html">
            
                    
                    进阶 5：关于 add
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.11" data-path="进阶 6：看看我都改了什么.html">
            
                <a href="进阶 6：看看我都改了什么.html">
            
                    
                    进阶 6：看看我都改了什么
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.12" data-path="高级 1：不喜欢 merge 的分叉？用 rebase 吧.html">
            
                <a href="高级 1：不喜欢 merge 的分叉？用 rebase 吧.html">
            
                    
                    高级 1：不喜欢 merge 的分叉？用 rebase 吧
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.13" data-path="高级 2：刚刚提交的代码，发现写错了怎么办.html">
            
                <a href="高级 2：刚刚提交的代码，发现写错了怎么办.html">
            
                    
                    高级 2：刚刚提交的代码，发现写错了怎么办
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.14" data-path="高级 3：写错的不是最新的提交，而是倒数第二个？.html">
            
                <a href="高级 3：写错的不是最新的提交，而是倒数第二个？.html">
            
                    
                    高级 3：写错的不是最新的提交，而是倒数第二个？
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.15" data-path="高级 4：比错还错，想直接丢弃刚写的提交？.html">
            
                <a href="高级 4：比错还错，想直接丢弃刚写的提交？.html">
            
                    
                    高级 4：比错还错，想直接丢弃刚写的提交？
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.16" data-path="高级 5：想丢弃的也不是最新的提交？.html">
            
                <a href="高级 5：想丢弃的也不是最新的提交？.html">
            
                    
                    高级 5：想丢弃的也不是最新的提交？
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.17" data-path="高级 6：代码已经 push 上去了才发现写错？.html">
            
                <a href="高级 6：代码已经 push 上去了才发现写错？.html">
            
                    
                    高级 6：代码已经 push 上去了才发现写错？
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.18" data-path="高级 7：reset 的本质——不止可以撤销提交.html">
            
                <a href="高级 7：reset 的本质——不止可以撤销提交.html">
            
                    
                    高级 7：reset 的本质——不止可以撤销提交
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.19" data-path="高级 8：checkout 的本质.html">
            
                <a href="高级 8：checkout 的本质.html">
            
                    
                    高级 8：checkout 的本质
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.20" data-path="高级 9：紧急情况：「立即给我打个包，现在马上！」.html">
            
                <a href="高级 9：紧急情况：「立即给我打个包，现在马上！」.html">
            
                    
                    高级 9：紧急情况：「立即给我打个包，现在马上！」
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.21" data-path="高级 10：branch 删过了才想起来有用？.html">
            
                <a href="高级 10：branch 删过了才想起来有用？.html">
            
                    
                    高级 10：branch 删过了才想起来有用？
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.22" data-path="额外说点：.gitignore——排除不想被管理的文件和目录.html">
            
                <a href="额外说点：.gitignore——排除不想被管理的文件和目录.html">
            
                    
                    额外说点：.gitignore——排除不想被管理的文件和目录
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.23" data-path="总结.html">
            
                <a href="总结.html">
            
                    
                    总结
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >什么是分布式版本控制系统（DVCS）</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x4EC0;&#x4E48;&#x662F;&#x5206;&#x5E03;&#x5F0F;&#x7248;&#x672C;&#x63A7;&#x5236;&#x7CFB;&#x7EDF;&#xFF08;dvcs&#xFF09;">&#x4EC0;&#x4E48;&#x662F;&#x5206;&#x5E03;&#x5F0F;&#x7248;&#x672C;&#x63A7;&#x5236;&#x7CFB;&#x7EDF;&#xFF08;DVCS&#xFF09;</h1>
<p>&#x5206;&#x5E03;&#x5F0F; VCS &#xFF08;Distributed VCS / DVCS&#xFF09;&#x548C;&#x4E2D;&#x592E;&#x5F0F;&#x7684;&#x533A;&#x522B;&#x5728;&#x4E8E;&#xFF0C;&#x5206;&#x5E03;&#x5F0F; VCS &#x9664;&#x4E86;&#x4E2D;&#x592E;&#x4ED3;&#x5E93;&#x4E4B;&#x5916;&#xFF0C;&#x8FD8;&#x6709;&#x672C;&#x5730;&#x4ED3;&#x5E93;&#xFF1A;&#x56E2;&#x961F;&#x4E2D;&#x6BCF;&#x4E00;&#x4E2A;&#x6210;&#x5458;&#x7684;&#x673A;&#x5668;&#x4E0A;&#x90FD;&#x6709;&#x4E00;&#x4EFD;&#x672C;&#x5730;&#x4ED3;&#x5E93;&#xFF0C;&#x8FD9;&#x4E2A;&#x4ED3;&#x5E93;&#x91CC;&#x5305;&#x542B;&#x4E86;&#x6240;&#x6709;&#x7684;&#x7248;&#x672C;&#x5386;&#x53F2;&#xFF0C;&#x6216;&#x8005;&#x6362;&#x53E5;&#x8BDD;&#x8BF4;&#xFF0C;&#x6BCF;&#x4E2A;&#x4EBA;&#x5728;&#x81EA;&#x5DF1;&#x7684;&#x673A;&#x5668;&#x4E0A;&#x5C31;&#x53EF;&#x4EE5;&#x63D0;&#x4EA4;&#x4EE3;&#x7801;&#x3001;&#x67E5;&#x770B;&#x5386;&#x53F2;&#xFF0C;&#x800C;&#x65E0;&#x9700;&#x8054;&#x7F51;&#x548C;&#x4E2D;&#x592E;&#x4ED3;&#x5E93;&#x4EA4;&#x4E92;&#x2014;&#x2014;&#x5F53;&#x7136;&#xFF0C;&#x53D6;&#x800C;&#x4EE3;&#x4E4B;&#x7684;&#xFF0C;&#x4F60;&#x9700;&#x8981;&#x548C;&#x672C;&#x5730;&#x4ED3;&#x5E93;&#x4EA4;&#x4E92;&#x3002;</p>
<p>&#x4E2D;&#x592E;&#x5F0F; VCS &#x7684;&#x4E2D;&#x592E;&#x4ED3;&#x5E93;&#x6709;&#x4E24;&#x4E2A;&#x4E3B;&#x8981;&#x529F;&#x80FD;&#xFF1A;<strong>&#x4FDD;&#x5B58;&#x7248;&#x672C;&#x5386;&#x53F2;</strong>&#x3001;<strong>&#x540C;&#x6B65;&#x56E2;&#x961F;&#x4EE3;&#x7801;</strong>&#x3002;&#x800C;&#x5728;&#x5206;&#x5E03;&#x5F0F; VCS &#x4E2D;&#xFF0C;&#x4FDD;&#x5B58;&#x7248;&#x672C;&#x5386;&#x53F2;&#x7684;&#x5DE5;&#x4F5C;&#x8F6C;&#x4EA4;&#x5230;&#x4E86;&#x6BCF;&#x4E2A;&#x56E2;&#x961F;&#x6210;&#x5458;&#x7684;&#x672C;&#x5730;&#x4ED3;&#x5E93;&#x4E2D;&#xFF0C;&#x4E2D;&#x592E;&#x4ED3;&#x5E93;&#x5C31;&#x53EA;&#x5269;&#x4E0B;&#x4E86;&#x540C;&#x6B65;&#x56E2;&#x961F;&#x4EE3;&#x7801;&#x8FD9;&#x4E00;&#x4E2A;&#x4E3B;&#x8981;&#x4EFB;&#x52A1;&#x3002;&#x5B83;&#x7684;&#x4E2D;&#x592E;&#x4ED3;&#x5E93;&#x4F9D;&#x7136;&#x4E5F;&#x4FDD;&#x5B58;&#x4E86;&#x5386;&#x53F2;&#x7248;&#x672C;&#xFF0C;&#x4F46;&#x8FD9;&#x4EFD;&#x5386;&#x53F2;&#x7248;&#x672C;&#x66F4;&#x591A;&#x7684;&#x662F;&#x4F5C;&#x4E3A;&#x56E2;&#x961F;&#x95F4;&#x7684;&#x540C;&#x6B65;&#x4E2D;&#x8F6C;&#x7AD9;&#x3002;</p>
<h2 id="&#x5DE5;&#x4F5C;&#x6A21;&#x578B;">&#x5DE5;&#x4F5C;&#x6A21;&#x578B;</h2>
<p>&#x4F9D;&#x7136;&#x4EE5;&#x4E09;&#x4EBA;&#x56E2;&#x961F;&#x4E3A;&#x4F8B;&#xFF0C;&#x5206;&#x5E03;&#x5F0F; VCS &#x7684;&#x5DE5;&#x4F5C;&#x6A21;&#x578B;&#x5927;&#x81F4;&#x662F;&#x8FD9;&#x6837;&#xFF1A;</p>
<ol>
<li>&#x9996;&#x5148;&#xFF0C;&#x4F60;&#x4F5C;&#x4E3A;&#x4E3B;&#x5DE5;&#x7A0B;&#x5E08;&#xFF0C;&#x72EC;&#x7ACB;&#x642D;&#x5EFA;&#x4E86;&#x9879;&#x76EE;&#x67B6;&#x6784;&#xFF0C;<strong>&#x5E76;&#x628A;&#x8FD9;&#x4E9B;&#x4EE3;&#x7801;&#x63D0;&#x4EA4;&#x5230;&#x4E86;&#x672C;&#x5730;&#x4ED3;&#x5E93;</strong>&#xFF1B;</li>
<li>&#x7136;&#x540E;&#xFF0C;&#x4F60;&#x5728;&#x670D;&#x52A1;&#x5668;&#x4E0A;&#x521B;&#x5EFA;&#x4E86;&#x4E00;&#x4E2A;&#x4E2D;&#x592E;&#x4ED3;&#x5E93;&#xFF0C;&#x5E76;&#x628A; 1 &#x4E2D;&#x7684;&#x63D0;&#x4EA4;<strong>&#x4ECE;&#x672C;&#x5730;&#x4ED3;&#x5E93;&#x63A8;&#x9001;&#x5230;&#x4E86;&#x670D;&#x52A1;&#x5668;&#x7684;&#x4E2D;&#x592E;&#x4ED3;&#x5E93;</strong>&#xFF1B;</li>
<li>&#x5176;&#x4ED6;&#x540C;&#x4E8B;<strong>&#x628A;&#x4E2D;&#x592E;&#x4ED3;&#x5E93;&#x7684;&#x6240;&#x6709;&#x5185;&#x5BB9;&#x514B;&#x9686;&#x5230;&#x672C;&#x5730;&#xFF0C;&#x62E5;&#x6709;&#x4E86;&#x5404;&#x81EA;&#x7684;&#x672C;&#x5730;&#x4ED3;&#x5E93;</strong>&#xFF0C;&#x4ECE;&#x6B64;&#x523B;&#x5F00;&#x59CB;&#xFF0C;&#x4F60;&#x4EEC;&#x4E09;&#x4EBA;&#x5F00;&#x59CB;&#x5E76;&#x884C;&#x5F00;&#x53D1;&#xFF1B;</li>
<li>&#x5728;&#x4E4B;&#x540E;&#x7684;&#x5F00;&#x53D1;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x4F60;&#x4EEC;&#x4E09;&#x4EBA;&#x603B;&#x662F;&#x6BCF;&#x4EBA;&#x72EC;&#x7ACB;&#x8D1F;&#x8D23;&#x5F00;&#x53D1;&#x4E00;&#x4E2A;&#x529F;&#x80FD;&#xFF0C;&#x5728;&#x8FD9;&#x4E2A;&#x529F;&#x80FD;&#x5F00;&#x53D1;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;<strong>&#x4E00;&#x4E2A;&#x4EBA;&#x4F1A;&#x628A;&#x5B83;&#x7684;&#x6BCF;&#x4E00;&#x6B65;&#x6539;&#x52A8;&#x63D0;&#x4EA4;&#x5230;&#x672C;&#x5730;&#x4ED3;&#x5E93;</strong>&#x3002;&#x6CE8;&#x610F;&#xFF1A;&#x7531;&#x4E8E;&#x672C;&#x5730;&#x63D0;&#x4EA4;&#x65E0;&#x9700;&#x7ACB;&#x5373;&#x4E0A;&#x4F20;&#x5230;&#x4E2D;&#x592E;&#x4ED3;&#x5E93;&#xFF0C;&#x6240;&#x4EE5;&#x6BCF;&#x4E00;&#x6B65;&#x63D0;&#x4EA4;&#x4E0D;&#x5FC5;&#x662F;&#x4E00;&#x4E2A;&#x5B8C;&#x6574;&#x529F;&#x80FD;&#xFF0C;&#x800C;&#x53EF;&#x4EE5;&#x662F;&#x529F;&#x80FD;&#x4E2D;&#x7684;&#x4E00;&#x4E2A;&#x6B65;&#x9AA4;&#x6216;&#x5757;&#x3002;</li>
<li>&#x5728;&#x4E00;&#x4E2A;&#x4EBA;&#x628A;&#x67D0;&#x4E2A;&#x529F;&#x80FD;&#x5F00;&#x53D1;&#x5B8C;&#x6210;&#x4E4B;&#x540E;&#xFF0C;&#x4ED6;&#x5C31;&#x53EF;&#x4EE5;&#x628A;&#x8FD9;&#x4E2A;&#x529F;&#x80FD;&#x76F8;&#x5173;&#x7684;&#x6240;&#x6709;&#x63D0;&#x4EA4;<strong>&#x4ECE;&#x672C;&#x5730;&#x4ED3;&#x5E93;&#x63A8;&#x9001;&#x5230;&#x4E2D;&#x592E;&#x4ED3;&#x5E93;</strong>&#xFF1B;</li>
<li>&#x6BCF;&#x6B21;&#x5F53;&#x6709;&#x4EBA;&#x628A;&#x65B0;&#x7684;&#x63D0;&#x4EA4;&#x63A8;&#x9001;&#x5230;&#x4E2D;&#x592E;&#x4ED3;&#x5E93;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x53E6;&#x5916;&#x4E24;&#x4E2A;&#x4EBA;&#x5C31;&#x53EF;&#x4EE5;&#x9009;&#x62E9;<strong>&#x628A;&#x8FD9;&#x4E9B;&#x63D0;&#x4EA4;&#x540C;&#x6B65;&#x5230;&#x81EA;&#x5DF1;&#x7684;&#x673A;&#x5668;&#x4E0A;&#xFF0C;&#x5E76;&#x628A;&#x5B83;&#x4EEC;&#x548C;&#x81EA;&#x5DF1;&#x7684;&#x672C;&#x5730;&#x4EE3;&#x7801;&#x5408;&#x5E76;</strong>&#x3002;</li>
</ol>
<p><img src="https://user-gold-cdn.xitu.io/2017/11/30/1600a9a4a20c2e6e?w=657&amp;h=446&amp;f=jpeg&amp;s=30737" alt="&#x5206;&#x5E03;&#x5F0F; VCS"></p>
<p>&#x53EF;&#x4EE5;&#x770B;&#x51FA;&#xFF0C;&#x8FD9;&#x4E2A;&#x5DE5;&#x4F5C;&#x6A21;&#x578B;&#x548C;&#x4E0A;&#x4E00;&#x8282;&#x8BB2;&#x7684;&#x300C;&#x4E2D;&#x592E;&#x5F0F; VCS &#x7684;&#x5DE5;&#x4F5C;&#x6A21;&#x578B;&#x300D;&#x5F88;&#x76F8;&#x4F3C;&#xFF0C;&#x53EA;&#x662F;&#x628A;&#x4EE3;&#x7801;&#x7684;&#x63D0;&#x4EA4;&#x548C;&#x4E0A;&#x4F20;&#x8FC7;&#x7A0B;&#x62C6;&#x5F00;&#x4E86;&#x3002;</p>
<p>&#x53E6;&#x5916;&#xFF0C;&#x548C;&#x4E0A;&#x8282;&#x8BB2;&#x7684;&#x4E2D;&#x592E;&#x5F0F; VCS &#x5DE5;&#x4F5C;&#x6A21;&#x578B;&#x4E00;&#x6837;&#xFF0C;&#x8FD9;&#x4E2A;&#x4E5F;&#x53EA;&#x662F;&#x5206;&#x5E03;&#x5F0F; VCS &#x7684;&#x4E00;&#x4E2A;&#x6700;&#x57FA;&#x672C;&#x7684;&#x5DE5;&#x4F5C;&#x6A21;&#x578B;&#xFF0C;&#x5B9E;&#x9645;&#x7684;&#x5F00;&#x53D1;&#x5DE5;&#x4F5C;&#x4F1A;&#x6BD4;&#x8FD9;&#x4E2A;&#x9EBB;&#x70E6;&#x548C;&#x590D;&#x6742;&#x3002;&#x4F46;&#x8FD9;&#x662F;&#x4E2A;&#x6838;&#x5FC3;&#x6A21;&#x578B;&#xFF0C;&#x4F60;&#x628A;&#x5B83;&#x7406;&#x89E3;&#x4E86;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x66F4;&#x597D;&#x5730;&#x770B;&#x61C2;&#x540E;&#x9762;&#x7684;&#x5185;&#x5BB9;&#x3002;</p>
<h2 id="&#x4F18;&#x70B9;&#x4E0E;&#x7F3A;&#x70B9;">&#x4F18;&#x70B9;&#x4E0E;&#x7F3A;&#x70B9;</h2>
<p>&#x5206;&#x5E03;&#x5F0F; VCS &#x7684;&#x4F18;&#x70B9;&#xFF1A;</p>
<ol>
<li>&#x5927;&#x591A;&#x6570;&#x7684;&#x64CD;&#x4F5C;&#x53EF;&#x4EE5;&#x5728;&#x672C;&#x5730;&#x8FDB;&#x884C;&#xFF0C;&#x6240;&#x4EE5;&#x901F;&#x5EA6;&#x66F4;&#x5FEB;&#xFF0C;&#x800C;&#x4E14;&#x7531;&#x4E8E;&#x65E0;&#x9700;&#x8054;&#x7F51;&#xFF0C;&#x6240;&#x4EE5;&#x5373;&#x4F7F;&#x4E0D;&#x5728;&#x516C;&#x53F8;&#x751A;&#x81F3;&#x6CA1;&#x6709;&#x5728;&#x8054;&#x7F51;&#xFF0C;&#x4F60;&#x4E5F;&#x53EF;&#x4EE5;&#x63D0;&#x4EA4;&#x4EE3;&#x7801;&#x3001;&#x67E5;&#x770B;&#x5386;&#x53F2;&#xFF0C;&#x4ECE;&#x800C;&#x6781;&#x5927;&#x5730;&#x51CF;&#x5C0F;&#x4E86;&#x5F00;&#x53D1;&#x8005;&#x7684;&#x7F51;&#x7EDC;&#x6761;&#x4EF6;&#x548C;&#x7269;&#x7406;&#x4F4D;&#x7F6E;&#x7684;&#x9650;&#x5236;&#xFF08;&#x4F8B;&#x5982;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x5728;&#x98DE;&#x673A;&#x4E0A;&#x63D0;&#x4EA4;&#x4EE3;&#x7801;&#x3001;&#x5207;&#x6362;&#x5206;&#x652F;&#x7B49;&#x7B49;&#xFF09;&#xFF1B;</li>
<li>&#x7531;&#x4E8E;&#x53EF;&#x4EE5;&#x63D0;&#x4EA4;&#x5230;&#x672C;&#x5730;&#xFF0C;&#x6240;&#x4EE5;&#x4F60;&#x53EF;&#x4EE5;&#x5206;&#x6B65;&#x63D0;&#x4EA4;&#x4EE3;&#x7801;&#xFF0C;&#x628A;&#x4EE3;&#x7801;&#x63D0;&#x4EA4;&#x505A;&#x5F97;&#x66F4;&#x7EC6;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x4E00;&#x4E2A;&#x63D0;&#x4EA4;&#x5305;&#x542B;&#x5F88;&#x591A;&#x4EE3;&#x7801;&#xFF0C;&#x96BE;&#x4EE5; review &#x4E5F;&#x96BE;&#x4EE5;&#x56DE;&#x6EAF;&#x3002;</li>
</ol>
<p>&#x5206;&#x5E03;&#x5F0F; VCS &#x7684;&#x7F3A;&#x70B9;&#xFF1A;</p>
<ol>
<li>&#x7531;&#x4E8E;&#x6BCF;&#x4E00;&#x4E2A;&#x673A;&#x5668;&#x90FD;&#x6709;&#x5B8C;&#x6574;&#x7684;&#x672C;&#x5730;&#x4ED3;&#x5E93;&#xFF0C;&#x6240;&#x4EE5;&#x521D;&#x6B21;&#x83B7;&#x53D6;&#x9879;&#x76EE;&#xFF08;Git &#x672F;&#x8BED;&#xFF1A;clone&#xFF09;&#x7684;&#x65F6;&#x5019;&#x4F1A;&#x6BD4;&#x8F83;&#x8017;&#x65F6;&#xFF1B;</li>
<li>&#x7531;&#x4E8E;&#x6BCF;&#x4E2A;&#x673A;&#x5668;&#x90FD;&#x6709;&#x5B8C;&#x6574;&#x7684;&#x672C;&#x5730;&#x4ED3;&#x5E93;&#xFF0C;&#x6240;&#x4EE5;&#x672C;&#x5730;&#x5360;&#x7528;&#x7684;&#x5B58;&#x50A8;&#x6BD4;&#x4E2D;&#x592E;&#x5F0F; VCS &#x8981;&#x9AD8;&#x3002;</li>
</ol>
<blockquote>
<p>&#x5BF9;&#x4E8E;&#x4E00;&#x822C;&#x7684;&#x7A0B;&#x5E8F;&#x9879;&#x76EE;&#x800C;&#x8A00;&#xFF0C;&#x7531;&#x4E8E;&#x9879;&#x76EE;&#x7684;&#x5927;&#x591A;&#x6570;&#x5185;&#x5BB9;&#x90FD;&#x662F;&#x6587;&#x672C;&#x5F62;&#x5F0F;&#x7684;&#x4EE3;&#x7801;&#xFF0C;&#x6240;&#x4EE5;&#x5DE5;&#x7A0B;&#x7684;&#x4F53;&#x79EF;&#x90FD;&#x5E76;&#x4E0D;&#x662F;&#x5F88;&#x5927;&#xFF0C;&#x518D;&#x52A0;&#x4E0A;&#x6587;&#x672C;&#x5185;&#x5BB9;&#x81EA;&#x8EAB;&#x7684;&#x7279;&#x70B9;&#xFF0C;VCS &#x53EF;&#x4EE5;&#x5229;&#x7528;&#x7B97;&#x6CD5;&#x6765;&#x628A;&#x4ED3;&#x5E93;&#x7684;&#x4F53;&#x79EF;&#x6781;&#x5927;&#x5730;&#x538B;&#x7F29;&#x3002;&#x8FD9;&#x5C31;&#x5BFC;&#x81F4;&#xFF0C;&#x5728;&#x5B9E;&#x9645;&#x4E2D;&#xFF0C;Git &#x7B49;&#x5206;&#x5E03;&#x5F0F; VCS &#x7684;&#x4ED3;&#x5E93;&#x4F53;&#x79EF;&#x5E76;&#x4E0D;&#x5927;&#xFF0C;&#x521D;&#x6B21;&#x83B7;&#x53D6;&#x9879;&#x76EE;&#x7684;&#x8017;&#x65F6;&#x548C;&#x672C;&#x5730;&#x4ED3;&#x5E93;&#x7684;&#x5B58;&#x50A8;&#x5360;&#x7528;&#x90FD;&#x5F88;&#x5C0F;&#x3002;&#x6240;&#x4EE5;&#x5BF9;&#x4E8E;&#x5927;&#x591A;&#x6570;&#x7684;&#x7A0B;&#x5E8F;&#x9879;&#x76EE;&#x800C;&#x8A00;&#xFF0C;&#x5206;&#x5E03;&#x5F0F; VCS &#x300C;&#x5C3A;&#x5BF8;&#x5927;&#x3001;&#x521D;&#x6B21;&#x4E0B;&#x8F7D;&#x6162;&#x300D;&#x7684;&#x95EE;&#x9898;&#x5176;&#x5B9E;&#x5E76;&#x4E0D;&#x4E25;&#x91CD;&#x3002;</p>
<p>&#x4E0D;&#x8FC7;&#x4E5F;&#x6709;&#x4E00;&#x4E9B;&#x4F8B;&#x5916;&#xFF0C;&#x6BD4;&#x5982;&#x6E38;&#x620F;&#x5F00;&#x53D1;&#x3002;&#x6E38;&#x620F;&#x7684;&#x5F00;&#x53D1;&#x4E2D;&#x6709;&#x5927;&#x91CF;&#x7684;&#x5927;&#x5C3A;&#x5BF8;&#x6570;&#x636E;&#x548C;&#x5A92;&#x4F53;&#x6587;&#x4EF6;&#xFF0C;&#x5E76;&#x4E14;&#x8FD9;&#x4E9B;&#x6587;&#x4EF6;&#x7684;&#x683C;&#x5F0F;&#x4E5F;&#x4E0D;&#x5BB9;&#x6613;&#x538B;&#x7F29;&#x5C3A;&#x5BF8;&#xFF0C;&#x5982;&#x679C;&#x7528;&#x5206;&#x5E03;&#x5F0F; VCS &#x4F1A;&#x5BFC;&#x81F4;&#x4ED3;&#x5E93;&#x7684;&#x4F53;&#x79EF;&#x975E;&#x5E38;&#x5E9E;&#x5927;&#x3002;&#x6240;&#x4EE5;&#x4E00;&#x4E9B;&#x5927;&#x578B;&#x6E38;&#x620F;&#x7684;&#x5F00;&#x53D1;&#x4F1A;&#x9009;&#x62E9;&#x4E2D;&#x592E;&#x5F0F;&#x7684; VCS &#x6765;&#x7BA1;&#x7406;&#x4EE3;&#x7801;&#x3002;</p>
</blockquote>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="什么是版本控制系统VCS.html" class="navigation navigation-prev " aria-label="Previous page: 什么是版本控制系统（VCS）">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="上手 1：新公司用 Git 管理代码，怎么快速上手？.html" class="navigation navigation-next " aria-label="Next page: 上手 1：新公司用 Git 管理代码，怎么快速上手？">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"什么是分布式版本控制系统（DVCS）","level":"1.3","depth":1,"next":{"title":"上手 1：新公司用 Git 管理代码，怎么快速上手？","level":"1.4","depth":1,"path":"上手 1：新公司用 Git 管理代码，怎么快速上手？.md","ref":"上手 1：新公司用 Git 管理代码，怎么快速上手？.md","articles":[]},"previous":{"title":"什么是版本控制系统（VCS）","level":"1.2","depth":1,"path":"什么是版本控制系统VCS.md","ref":"什么是版本控制系统VCS.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":[],"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"什么是分布式版本控制系统DVCS.md","mtime":"2018-12-08T13:27:19.198Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2018-12-08T14:41:17.869Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

