
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>什么是版本控制系统（VCS） · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="什么是分布式版本控制系统DVCS.html" />
    
    
    <link rel="prev" href="./" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    前言
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.2" data-path="什么是版本控制系统VCS.html">
            
                <a href="什么是版本控制系统VCS.html">
            
                    
                    什么是版本控制系统（VCS）
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="什么是分布式版本控制系统DVCS.html">
            
                <a href="什么是分布式版本控制系统DVCS.html">
            
                    
                    什么是分布式版本控制系统（DVCS）
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="上手 1：新公司用 Git 管理代码，怎么快速上手？.html">
            
                <a href="上手 1：新公司用 Git 管理代码，怎么快速上手？.html">
            
                    
                    上手 1：新公司用 Git 管理代码，怎么快速上手？
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="上手 2：团队工作的基本工作模型.html">
            
                <a href="上手 2：团队工作的基本工作模型.html">
            
                    
                    上手 2：团队工作的基本工作模型
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="进阶 1：HEAD、master 与 branch.html">
            
                <a href="进阶 1：HEAD、master 与 branch.html">
            
                    
                    进阶 1：HEAD、master 与 branch
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="进阶 2：push 的本质.html">
            
                <a href="进阶 2：push 的本质.html">
            
                    
                    进阶 2：push 的本质
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="进阶 3：merge：合并 commits.html">
            
                <a href="进阶 3：merge：合并 commits.html">
            
                    
                    进阶 3：merge：合并 commits
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9" data-path="进阶 4：Feature Branching：最流行的工作流.html">
            
                <a href="进阶 4：Feature Branching：最流行的工作流.html">
            
                    
                    进阶 4：Feature Branching：最流行的工作流
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.10" data-path="进阶 5：关于 add.html">
            
                <a href="进阶 5：关于 add.html">
            
                    
                    进阶 5：关于 add
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.11" data-path="进阶 6：看看我都改了什么.html">
            
                <a href="进阶 6：看看我都改了什么.html">
            
                    
                    进阶 6：看看我都改了什么
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.12" data-path="高级 1：不喜欢 merge 的分叉？用 rebase 吧.html">
            
                <a href="高级 1：不喜欢 merge 的分叉？用 rebase 吧.html">
            
                    
                    高级 1：不喜欢 merge 的分叉？用 rebase 吧
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.13" data-path="高级 2：刚刚提交的代码，发现写错了怎么办.html">
            
                <a href="高级 2：刚刚提交的代码，发现写错了怎么办.html">
            
                    
                    高级 2：刚刚提交的代码，发现写错了怎么办
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.14" data-path="高级 3：写错的不是最新的提交，而是倒数第二个？.html">
            
                <a href="高级 3：写错的不是最新的提交，而是倒数第二个？.html">
            
                    
                    高级 3：写错的不是最新的提交，而是倒数第二个？
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.15" data-path="高级 4：比错还错，想直接丢弃刚写的提交？.html">
            
                <a href="高级 4：比错还错，想直接丢弃刚写的提交？.html">
            
                    
                    高级 4：比错还错，想直接丢弃刚写的提交？
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.16" data-path="高级 5：想丢弃的也不是最新的提交？.html">
            
                <a href="高级 5：想丢弃的也不是最新的提交？.html">
            
                    
                    高级 5：想丢弃的也不是最新的提交？
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.17" data-path="高级 6：代码已经 push 上去了才发现写错？.html">
            
                <a href="高级 6：代码已经 push 上去了才发现写错？.html">
            
                    
                    高级 6：代码已经 push 上去了才发现写错？
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.18" data-path="高级 7：reset 的本质——不止可以撤销提交.html">
            
                <a href="高级 7：reset 的本质——不止可以撤销提交.html">
            
                    
                    高级 7：reset 的本质——不止可以撤销提交
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.19" data-path="高级 8：checkout 的本质.html">
            
                <a href="高级 8：checkout 的本质.html">
            
                    
                    高级 8：checkout 的本质
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.20" data-path="高级 9：紧急情况：「立即给我打个包，现在马上！」.html">
            
                <a href="高级 9：紧急情况：「立即给我打个包，现在马上！」.html">
            
                    
                    高级 9：紧急情况：「立即给我打个包，现在马上！」
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.21" data-path="高级 10：branch 删过了才想起来有用？.html">
            
                <a href="高级 10：branch 删过了才想起来有用？.html">
            
                    
                    高级 10：branch 删过了才想起来有用？
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.22" data-path="额外说点：.gitignore——排除不想被管理的文件和目录.html">
            
                <a href="额外说点：.gitignore——排除不想被管理的文件和目录.html">
            
                    
                    额外说点：.gitignore——排除不想被管理的文件和目录
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.23" data-path="总结.html">
            
                <a href="总结.html">
            
                    
                    总结
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >什么是版本控制系统（VCS）</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x4EC0;&#x4E48;&#x662F;&#x7248;&#x672C;&#x63A7;&#x5236;&#x7CFB;&#x7EDF;&#xFF08;vcs&#xFF09;">&#x4EC0;&#x4E48;&#x662F;&#x7248;&#x672C;&#x63A7;&#x5236;&#x7CFB;&#x7EDF;&#xFF08;VCS&#xFF09;</h1>
<p>&#x5F88;&#x591A;&#x4EBA;&#x8BA4;&#x4E3A; Git &#x96BE;&#x4EE5;&#x7406;&#x89E3;&#x7684;&#x7B2C;&#x4E00;&#x4E2A;&#x95E8;&#x69DB;&#x5728;&#x4E8E;&#xFF1A;&#x6240;&#x8C13;&#x7684;&#x300C;Git &#x662F;&#x4E00;&#x4E2A;&#x5206;&#x5E03;&#x5F0F;&#x7248;&#x672C;&#x63A7;&#x5236;&#x7CFB;&#x7EDF;&#x300D;&#x8FD9;&#x53E5;&#x8BDD;&#x7684;&#x5177;&#x4F53;&#x542B;&#x4E49;&#x4E0D;&#x591F;&#x6E05;&#x695A;&#x3002;&#x5176;&#x5B9E;&#x5206;&#x5E03;&#x5F0F;&#x7248;&#x672C;&#x63A7;&#x5236;&#x7CFB;&#x7EDF;&#xFF08;Distributed Version Control System - DVCS&#xFF09;&#x8FD9;&#x4E2A;&#x5B9A;&#x4E49;&#x5E76;&#x4E0D;&#x96BE;&#xFF0C;&#x4E0D;&#x8FC7;&#x4E00;&#x6B65;&#x4E00;&#x6B65;&#x6765;&#xFF0C;&#x6211;&#x5148;&#x544A;&#x8BC9;&#x4F60;&#xFF0C;&#x4EC0;&#x4E48;&#x662F;&#x7248;&#x672C;&#x63A7;&#x5236;&#x7CFB;&#x7EDF;&#xFF08;Version Control System - VCS&#xFF09;&#x3002;</p>
<h3 id="&#x7248;&#x672C;&#x63A7;&#x5236;&#xFF1A;&#x6700;&#x57FA;&#x672C;&#x529F;&#x80FD;">&#x7248;&#x672C;&#x63A7;&#x5236;&#xFF1A;&#x6700;&#x57FA;&#x672C;&#x529F;&#x80FD;</h3>
<blockquote>
<p>&#x7248;&#x672C;&#x63A7;&#x5236;&#x7CFB;&#x7EDF;&#xFF08;VCS&#xFF09;&#x6700;&#x57FA;&#x672C;&#x7684;&#x529F;&#x80FD;&#x662F;&#x7248;&#x672C;&#x63A7;&#x5236;&#x3002;&#x6240;&#x8C13;&#x7248;&#x672C;&#x63A7;&#x5236;&#xFF0C;&#x610F;&#x601D;&#x5C31;&#x662F;&#x5728;&#x6587;&#x4EF6;&#x7684;&#x4FEE;&#x6539;&#x5386;&#x7A0B;&#x4E2D;&#x4FDD;&#x7559;&#x4FEE;&#x6539;&#x5386;&#x53F2;&#xFF0C;&#x8BA9;&#x4F60;&#x53EF;&#x4EE5;&#x65B9;&#x4FBF;&#x5730;&#x64A4;&#x9500;&#x4E4B;&#x524D;&#x5BF9;&#x6587;&#x4EF6;&#x7684;&#x4FEE;&#x6539;&#x64CD;&#x4F5C;&#x3002;</p>
</blockquote>
<p>&#x6700;&#x7B80;&#x5316;&#x7684;&#x7248;&#x672C;&#x63A7;&#x5236;&#x6A21;&#x578B;&#xFF0C;&#x662F;&#x5927;&#x591A;&#x6570;&#x4E3B;&#x6D41;&#x6587;&#x672C;&#x7F16;&#x8F91;&#x5668;&#x90FD;&#x6709;&#x7684;&#x300C;&#x64A4;&#x9500;&#xFF08;Undo&#xFF09;&#x300D;&#x529F;&#x80FD;&#xFF1A;&#x4F60;&#x672C;&#x6765;&#x60F3;&#x5220;&#x9664;&#x4E00;&#x4E2A;&#x5B57;&#x7B26;&#xFF0C;&#x5374;&#x5728;&#x6309;&#x5220;&#x9664;&#x952E;&#x4E4B;&#x524D;&#x4E0D;&#x5C0F;&#x5FC3;&#x9009;&#x4E2D;&#x4E86;&#x5168;&#x6587;&#xFF0C;&#x7ED3;&#x679C;&#x4E00;&#x4E0B;&#x5B50;&#x6574;&#x7BC7;&#x6587;&#x6863;&#x90FD;&#x88AB;&#x5220;&#x5149;&#x4E86;&#xFF0C;&#x6CA1;&#x5173;&#x7CFB;&#xFF0C;&#x6309;&#x4E00;&#x4E0B;&#x300C;&#x64A4;&#x9500;&#x300D;(Ctrl + Z &#x6216; &#x2318; + Z &#x6216; U &#x7B49;&#x7B49;&#xFF0C;&#x5177;&#x4F53;&#x548C;&#x4F60;&#x7684;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x4EE5;&#x53CA;&#x7F16;&#x8F91;&#x5668;&#x6709;&#x5173;&#xFF09;&#xFF0C;&#x5220;&#x6389;&#x7684;&#x6587;&#x5B57;&#x5C31;&#x90FD;&#x56DE;&#x6765;&#x4E86;&#x3002;&#x8FD9;&#x5176;&#x5B9E;&#x662F;&#x6587;&#x672C;&#x7F16;&#x8F91;&#x5668;&#x5E2E;&#x4F60;&#x81EA;&#x52A8;&#x4FDD;&#x5B58;&#x4E86;&#x4E4B;&#x524D;&#x7684;&#x5185;&#x5BB9;&#xFF0C;&#x5F53;&#x4F60;&#x6309;&#x4E0B;&#x300C;&#x64A4;&#x9500;&#x300D;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5B83;&#x5C31;&#x5E2E;&#x4F60;&#x628A;&#x5185;&#x5BB9;&#x56DE;&#x9000;&#x5230;&#x4E0A;&#x4E00;&#x4E2A;&#x72B6;&#x6001;&#xFF1B;&#x540C;&#x7406;&#xFF0C;&#x6309;&#x4E00;&#x6B21;&#x662F;&#x4F1A;&#x9000;&#x5230;&#x4E0A;&#x4E00;&#x4E2A;&#x7248;&#x672C;&#xFF0C;&#x6309;&#x4E24;&#x6B21;&#x5C31;&#x662F;&#x56DE;&#x9000;&#x5230;&#x4E0A;&#x4E0A;&#x4E00;&#x4E2A;&#x7248;&#x672C;&#x3002;</p>
<p>&#x5199;&#x7A0B;&#x5E8F;&#x7684;&#x65F6;&#x5019;&#x540C;&#x6837;&#x4E5F;&#x96BE;&#x514D;&#x4F1A;&#x9047;&#x5230;&#x300C;&#x5199;&#x9519;&#x300D;&#x7684;&#x60C5;&#x51B5;&#xFF0C;&#x6240;&#x4EE5;&#x7A0B;&#x5E8F;&#x7684; VCS&#xFF0C;&#x5F53;&#x7136;&#x4E5F;&#x4F1A;&#x9700;&#x8981;&#x7248;&#x672C;&#x63A7;&#x5236;&#x529F;&#x80FD;&#xFF0C;&#x8FD9;&#x6837;&#x5F53;&#x4F60;&#x53D1;&#x73B0;&#x300C;&#x6628;&#x5929;&#x6709;&#x4E00;&#x884C;&#x4EE3;&#x7801;&#x5199;&#x9519;&#x4E86;&#x300D;&#xFF0C;&#x4F60;&#x5C31;&#x4E0D;&#x7528;&#x51ED;&#x7740;&#x8BB0;&#x5FC6;&#x628A;&#x90A3;&#x6BB5;&#x4EE3;&#x7801;&#x80CC;&#x51FA;&#x6765;&#xFF0C;&#x800C;&#x53EA;&#x9700;&#x8981;&#x5728; VCS &#x4E2D;&#x9009;&#x62E9;&#x64A4;&#x56DE;&#x5230;&#x6628;&#x5929;&#x7684;&#x90A3;&#x4E2A;&#x7248;&#x672C;&#x3002;</p>
<h3 id="&#x4E3B;&#x52A8;&#x63D0;&#x4EA4;&#xFF1A;&#x7A0B;&#x5E8F;&#x4EE3;&#x7801;&#x548C;&#x666E;&#x901A;&#x6587;&#x672C;&#x7684;&#x533A;&#x522B;">&#x4E3B;&#x52A8;&#x63D0;&#x4EA4;&#xFF1A;&#x7A0B;&#x5E8F;&#x4EE3;&#x7801;&#x548C;&#x666E;&#x901A;&#x6587;&#x672C;&#x7684;&#x533A;&#x522B;</h3>
<p>VCS &#x548C;&#x6587;&#x672C;&#x7F16;&#x8F91;&#x5668;&#x7684;&#x64A4;&#x9500;&#x529F;&#x80FD;&#x6BD4;&#x8D77;&#x6765;&#xFF0C;&#x6709;&#x4E00;&#x4E2A;&#x5F88;&#x91CD;&#x8981;&#x7684;&#x533A;&#x522B;&#x662F;&#xFF1A;&#x7A0B;&#x5E8F;&#x4EE3;&#x7801;&#x7684;&#x4FEE;&#x6539;&#x7684;&#x751F;&#x547D;&#x5468;&#x671F;&#x975E;&#x5E38;&#x957F;&#x3002;&#x4E00;&#x6B21;&#x4EE3;&#x7801;&#x7684;&#x4FEE;&#x6539;&#xFF0C;&#x5728;&#x51E0;&#x5929;&#x540E;&#x3001;&#x51E0;&#x4E2A;&#x6708;&#x540E;&#x3001;&#x51E0;&#x5E74;&#x540E;&#x90FD;&#x6709;&#x53EF;&#x80FD;&#x9700;&#x8981;&#x88AB;&#x7FFB;&#x51FA;&#x6765;&#x3002;&#x5982;&#x679C;&#x4F9D;&#x7136;&#x91C7;&#x7528;&#x300C;&#x6BCF;&#x6B21;&#x6539;&#x52A8;&#x81EA;&#x52A8;&#x4FDD;&#x5B58;&#x300D;&#x7684;&#x5F62;&#x5F0F;&#x6765;&#x4FDD;&#x7559;&#x4FEE;&#x6539;&#x5386;&#x53F2;&#xFF0C;&#x5C06;&#x4F1A;&#x5BFC;&#x81F4;&#x6539;&#x52A8;&#x5386;&#x53F2;&#x975E;&#x5E38;&#x9891;&#x7E41;&#x548C;&#x65E0;&#x7AE0;&#x53EF;&#x5FAA;&#xFF0C;&#x8FD9;&#x6837;&#xFF0C;&#x5386;&#x53F2;&#x4EE3;&#x7801;&#x7684;&#x67E5;&#x627E;&#x3001;&#x9605;&#x8BFB;&#x548C;&#x56DE;&#x9000;&#x5C31;&#x4F1A;&#x5F88;&#x56F0;&#x96BE;&#x4E86;&#x3002;&#x6240;&#x4EE5;&#xFF0C;&#x548C;&#x6587;&#x672C;&#x7F16;&#x8F91;&#x5668;&#x7684;&#x64A4;&#x9500;&#x529F;&#x80FD;&#x4E0D;&#x540C;&#xFF0C;VCS &#x4FDD;&#x5B58;&#x4FEE;&#x6539;&#x5386;&#x53F2;&#xFF0C;&#x4F7F;&#x7528;&#x7684;&#x662F;<strong>&#x4E3B;&#x52A8;&#x63D0;&#x4EA4;&#x6539;&#x52A8;</strong>&#x7684;&#x673A;&#x5236;&#x3002;</p>
<p>&#x5728;&#x4F60;&#x5199;&#x4E86;&#x4E00;&#x6BB5;&#x5B8C;&#x6574;&#x7684;&#x4EE3;&#x7801;&#xFF08;&#x4F8B;&#x5982;&#x4FEE;&#x590D;&#x4E86;&#x4E00;&#x4E2A; bug&#xFF09;&#x4E4B;&#x540E;&#xFF0C;&#x4F7F;&#x7528; commit &#x547D;&#x4EE4;&#x628A;&#x6539;&#x52A8;&#x548C;&#x5BF9;&#x6539;&#x52A8;&#x7684;&#x63CF;&#x8FF0;&#x4FE1;&#x606F;&#x63D0;&#x4EA4;&#xFF0C;&#x8FD9;&#x6B21;&#x6539;&#x52A8;&#x5C31;&#x88AB;&#x8BB0;&#x5F55;&#x5230;&#x7248;&#x672C;&#x5386;&#x53F2;&#x4E2D;&#x4E86;&#x3002;&#x4E4B;&#x540E;&#x5982;&#x679C;&#x4F60;&#x5E0C;&#x671B;&#x56DE;&#x9000;&#x5230;&#x8FD9;&#x4E2A;&#x7248;&#x672C;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x4ECE; VCS &#x7684;&#x5386;&#x53F2;&#x65E5;&#x5FD7;&#x4E2D;&#x65B9;&#x4FBF;&#x5730;&#x627E;&#x5230;&#x5B83;&#x3002;</p>
<h3 id="&#x591A;&#x4EBA;&#x5408;&#x4F5C;&#x7684;&#x540C;&#x6B65;&#x9700;&#x6C42;&#xFF1A;&#x4E2D;&#x592E;&#x4ED3;&#x5E93;">&#x591A;&#x4EBA;&#x5408;&#x4F5C;&#x7684;&#x540C;&#x6B65;&#x9700;&#x6C42;&#xFF1A;&#x4E2D;&#x592E;&#x4ED3;&#x5E93;</h3>
<p>&#x4EE3;&#x7801;&#x53EF;&#x4EE5;&#x4E00;&#x4E2A;&#x4EBA;&#x5199;&#xFF0C;&#x4F46;&#x66F4;&#x591A;&#x7684;&#x65F6;&#x5019;&#x4F1A;&#x662F;&#x591A;&#x4E2A;&#x4EBA;&#x5171;&#x540C;&#x5F00;&#x53D1;&#x3002;&#x90A3;&#x4E48;&#x81EA;&#x7136;&#x5730;&#xFF0C;&#x5C31;&#x9700;&#x8981;&#x6709;&#x4E00;&#x4E2A;&#x4E2D;&#x592E;&#x4ED3;&#x5E93;&#x4F5C;&#x4E3A;&#x4EE3;&#x7801;&#x7684;&#x5B58;&#x50A8;&#x4E2D;&#x5FC3;&#xFF1A;&#x6240;&#x6709;&#x4EBA;&#x7684;&#x6539;&#x52A8;&#x90FD;&#x4F1A;&#x4E0A;&#x4F20;&#x5230;&#x8FD9;&#x91CC;&#xFF0C;&#x6240;&#x6709;&#x4EBA;&#x90FD;&#x80FD;&#x4E5F;&#x90FD;&#x80FD;&#x770B;&#x5230;&#x548C;&#x4E0B;&#x8F7D;&#x5230;&#x522B;&#x4EBA;&#x4E0A;&#x4F20;&#x7684;&#x6539;&#x52A8;&#x3002;</p>
<p>&#x8FD9;&#x6837;&#xFF0C;&#x89E3;&#x51B3;&#x4E86;&#x540C;&#x6B65;&#x7684;&#x9700;&#x6C42;&#xFF0C;&#x591A;&#x4E2A;&#x4EBA;&#x5728;&#x4E0D;&#x540C;&#x7684;&#x673A;&#x5668;&#x4E0A;&#x5F00;&#x53D1;&#x540C;&#x4E00;&#x4E2A;&#x7A0B;&#x5E8F;&#x5C31;&#x6210;&#x4E86;&#x53EF;&#x80FD;&#x3002;</p>
<p><strong>&#x7248;&#x672C;&#x63A7;&#x5236;</strong>&#x3001;<strong>&#x4E3B;&#x52A8;&#x63D0;&#x4EA4;</strong>&#x3001;<strong>&#x4E2D;&#x592E;&#x4ED3;&#x5E93;</strong>&#x8FD9;&#x4E09;&#x4E2A;&#x8981;&#x7D20;&#xFF0C;&#x5171;&#x540C;&#x6784;&#x6210;&#x4E86;&#x7248;&#x672C;&#x63A7;&#x5236;&#x7CFB;&#x7EDF;&#xFF08;VCS&#xFF09;&#x7684;&#x6838;&#x5FC3;&#xFF1A;&#x5F00;&#x53D1;&#x56E2;&#x961F;&#x4E2D;&#x7684;&#x6BCF;&#x4E2A;&#x4EBA;&#x5411;&#x4E2D;&#x592E;&#x4ED3;&#x5E93;&#x4E3B;&#x52A8;&#x63D0;&#x4EA4;&#x81EA;&#x5DF1;&#x7684;&#x6539;&#x52A8;&#x548C;&#x540C;&#x6B65;&#x522B;&#x4EBA;&#x7684;&#x6539;&#x52A8;&#xFF0C;&#x5E76;&#x5728;&#x9700;&#x8981;&#x7684;&#x65F6;&#x5019;&#x67E5;&#x770B;&#x548C;&#x64CD;&#x4F5C;&#x5386;&#x53F2;&#x7248;&#x672C;&#xFF0C;&#x8FD9;&#x5C31;&#x662F;&#x7248;&#x672C;&#x63A7;&#x5236;&#x7CFB;&#x7EDF;&#x3002;</p>
<h2 id="&#x4E2D;&#x592E;&#x5F0F;&#x7248;&#x672C;&#x63A7;&#x5236;&#x7CFB;&#x7EDF;">&#x4E2D;&#x592E;&#x5F0F;&#x7248;&#x672C;&#x63A7;&#x5236;&#x7CFB;&#x7EDF;</h2>
<p>&#x6700;&#x521D;&#x7684;&#x7248;&#x672C;&#x63A7;&#x5236;&#x7CFB;&#x7EDF;&#xFF0C;&#x662F;&#x4E2D;&#x592E;&#x5F0F;&#x7248;&#x672C;&#x63A7;&#x5236;&#x7CFB;&#x7EDF;&#xFF08;Centralized VCS&#xFF09;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x524D;&#x9762;&#x6211;&#x8BB2;&#x7684;&#x8FD9;&#x79CD;&#x3002;Git &#x662F;&#x5206;&#x5E03;&#x5F0F;&#x7684;&#x7248;&#x672C;&#x63A7;&#x5236;&#x7CFB;&#x7EDF;&#xFF08;Distributed VCS&#xFF09;&#xFF0C;&#x5B83;&#x548C;&#x4E2D;&#x592E;&#x5F0F;&#x7684;&#x533A;&#x522B;&#x6211;&#x5728;&#x4E0B;&#x8282;&#x8BF4;&#xFF0C;&#x73B0;&#x5728;&#x5148;&#x8BF4;&#x4E00;&#x4E0B;&#x4E2D;&#x592E;&#x5F0F;&#x7248;&#x672C;&#x63A7;&#x5236;&#x7CFB;&#x7EDF;&#x7684;&#x5DE5;&#x4F5C;&#x6A21;&#x578B;&#x3002;</p>
<h3 id="&#x5DE5;&#x4F5C;&#x6A21;&#x578B;">&#x5DE5;&#x4F5C;&#x6A21;&#x578B;</h3>
<p>&#x5047;&#x8BBE;&#x4F60;&#x5728;&#x4E00;&#x4E2A;&#x4E09;&#x4EBA;&#x56E2;&#x961F;&#xFF0C;&#x4F60;&#x4EEC;&#x8BA1;&#x5212;&#x5F00;&#x53D1;&#x4E00;&#x4E2A;&#x8F6F;&#x4EF6;&#x6216;&#x8005;&#x7CFB;&#x7EDF;&#xFF0C;&#x5E76;&#x51B3;&#x5B9A;&#x4F7F;&#x7528;&#x4E2D;&#x592E;&#x5F0F; VCS &#x6765;&#x7BA1;&#x7406;&#x4EE3;&#x7801;&#x3002;&#x4E8E;&#x662F;&#xFF1A;</p>
<ol>
<li>&#x4F5C;&#x4E3A;&#x9879;&#x76EE;&#x7684;&#x4E3B;&#x5DE5;&#x7A0B;&#x5E08;&#xFF0C;&#x4F60;&#x72EC;&#x81EA;&#x4E00;&#x4EBA;&#x82B1;&#x4E24;&#x5929;&#x65F6;&#x95F4;&#x642D;&#x5EFA;&#x4E86;&#x9879;&#x76EE;&#x7684;&#x6846;&#x67B6;&#xFF1B;</li>
<li>&#x7136;&#x540E;&#xFF0C;&#x4F60;&#x5728;&#x516C;&#x53F8;&#x7684;&#x670D;&#x52A1;&#x5668;&#xFF08;&#x8FD9;&#x4E2A;&#x670D;&#x52A1;&#x5668;&#x53EF;&#x4EE5;&#x662F;&#x516C;&#x53F8;&#x5185;&#x7684;&#x8BBE;&#x5907;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x662F;&#x4F60;&#x4EEC;&#x4E70;&#x7684;&#x4E91;&#x670D;&#x52A1;&#xFF09;&#x4E0A;<strong>&#x521B;&#x5EFA;&#x4E86;&#x4E00;&#x4E2A;&#x4E2D;&#x592E;&#x4ED3;&#x5E93;&#xFF0C;&#x5E76;&#x628A;&#x4F60;&#x7684;&#x4EE3;&#x7801;&#x63D0;&#x4EA4;&#x5230;&#x4E86;&#x4E2D;&#x592E;&#x4ED3;&#x5E93;&#x4E0A;</strong>&#xFF1B;</li>
<li>&#x4F60;&#x7684;&#x4E24;&#x4E2A;&#x961F;&#x53CB;<strong>&#x4ECE;&#x4E2D;&#x592E;&#x4ED3;&#x5E93;&#x53D6;&#x5230;&#x4E86;&#x4F60;&#x7684;&#x521D;&#x59CB;&#x4EE3;&#x7801;</strong>&#xFF0C;&#x4ECE;&#x6B64;&#x523B;&#x5F00;&#x59CB;&#xFF0C;&#x4F60;&#x4EEC;&#x4E09;&#x4EBA;&#x5F00;&#x59CB;<strong>&#x5E76;&#x884C;&#x5F00;&#x53D1;</strong>&#xFF1B;</li>
<li>&#x5728;&#x4E4B;&#x540E;&#x7684;&#x5F00;&#x53D1;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x4F60;&#x4EEC;&#x4E09;&#x4EBA;&#x4E3A;&#x4E86;&#x5DE5;&#x4F5C;&#x65B9;&#x4FBF;&#xFF0C;&#x603B;&#x662F;&#x6BCF;&#x4EBA;&#x72EC;&#x7ACB;&#x8D1F;&#x8D23;&#x5F00;&#x53D1;&#x4E00;&#x4E2A;&#x529F;&#x80FD;&#xFF0C;&#x5728;&#x8FD9;&#x4E2A;&#x529F;&#x80FD;&#x5F00;&#x53D1;&#x5B8C;&#x6210;&#x540E;&#xFF0C;&#x8FD9;&#x4E2A;&#x4EBA;&#x5C31;&#x628A;&#x4ED6;&#x7684;&#x8FD9;&#x4E9B;<strong>&#x65B0;&#x4EE3;&#x7801;&#x63D0;&#x4EA4;&#x5230;&#x4E2D;&#x592E;&#x4ED3;&#x5E93;</strong>&#xFF1B;</li>
<li>&#x6BCF;&#x6B21;&#x5F53;&#x6709;&#x4EBA;&#x628A;&#x4EE3;&#x7801;&#x63D0;&#x4EA4;&#x5230;&#x4E2D;&#x592E;&#x4ED3;&#x5E93;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x53E6;&#x5916;&#x4E24;&#x4E2A;&#x4EBA;&#x5C31;&#x53EF;&#x4EE5;&#x9009;&#x62E9;<strong>&#x628A;&#x8FD9;&#x4E9B;&#x4EE3;&#x7801;&#x540C;&#x6B65;&#x5230;&#x81EA;&#x5DF1;&#x7684;&#x673A;&#x5668;&#x4E0A;</strong>&#xFF0C;&#x4FDD;&#x6301;&#x81EA;&#x5DF1;&#x7684;&#x672C;&#x5730;&#x4EE3;&#x7801;&#x603B;&#x662F;&#x6700;&#x65B0;&#x7684;&#x3002;</li>
</ol>
<p><img src="https://user-gold-cdn.xitu.io/2017/11/30/1600a9978ea4bec3?w=424&amp;h=313&amp;f=jpeg&amp;s=15661" alt="&#x4E2D;&#x592E;&#x5F0F; VCS"></p>
<p>&#x800C;&#x5BF9;&#x4E8E;&#x56E2;&#x961F;&#x4E2D;&#x7684;&#x6BCF;&#x4E2A;&#x4EBA;&#x6765;&#x8BF4;&#xFF0C;&#x5C31;&#x4F1A;&#x66F4;&#x7B80;&#x5355;&#x4E00;&#x70B9;&#xFF1A;</p>
<ol>
<li>&#x7B2C;&#x4E00;&#x6B21;&#x52A0;&#x5165;&#x56E2;&#x961F;&#x65F6;&#xFF0C;&#x628A;&#x4E2D;&#x592E;&#x4ED3;&#x5E93;&#x7684;&#x4EE3;&#x7801;&#x53D6;&#x4E0B;&#x6765;&#xFF1B;</li>
<li>&#x5199;&#x5B8C;&#x7684;&#x65B0;&#x529F;&#x80FD;&#x63D0;&#x4EA4;&#x5230;&#x4E2D;&#x592E;&#x4ED3;&#x5E93;&#xFF1B;</li>
<li>&#x540C;&#x4E8B;&#x63D0;&#x4EA4;&#x5230;&#x4E2D;&#x592E;&#x4ED3;&#x5E93;&#x7684;&#x65B0;&#x4EE3;&#x7801;&#xFF0C;&#x53CA;&#x65F6;&#x540C;&#x6B65;&#x4E0B;&#x6765;&#x3002;</li>
</ol>
<p>&#x8FD9;&#x6837;&#xFF0C;&#x4E00;&#x4E2A;&#x4E09;&#x4EBA;&#x7684;&#x56E2;&#x961F;&#x5C31;&#x6210;&#x529F;&#x505A;&#x5230;&#x4E86;&#x5404;&#x81EA;&#x5728;&#x81EA;&#x5DF1;&#x7684;&#x7535;&#x8111;&#x4E0A;&#x5F00;&#x53D1;&#x540C;&#x4E00;&#x4E2A;&#x9879;&#x76EE;&#xFF0C;&#x5E76;&#x4E14;&#x4E92;&#x4E0D;&#x5F71;&#x54CD;&#xFF0C;&#x5C31;&#x597D;&#x50CF;&#x4F60;&#x4EEC;&#x4E09;&#x4E2A;&#x4EBA;&#x662F;&#x5728;&#x540C;&#x4E00;&#x53F0;&#x7535;&#x8111;&#x4E0A;&#x64CD;&#x4F5C;&#x4E00;&#x6837;&#x3002;</p>
<p>&#x8FD9;&#x5C31;&#x662F;&#x4E2D;&#x592E;&#x5F0F; VCS &#x6700;&#x57FA;&#x672C;&#x7684;&#x5DE5;&#x4F5C;&#x6A21;&#x578B;&#x3002;&#x5F53;&#x7136;&#xFF0C;&#x5B9E;&#x9645;&#x7684;&#x5F00;&#x53D1;&#x5DE5;&#x4F5C;&#x5E76;&#x6CA1;&#x6709;&#x7B80;&#x5355;&#x5230;&#x8FD9;&#x79CD;&#x7A0B;&#x5EA6;&#xFF0C;&#x56E0;&#x4E3A;&#x4F60;&#x65F6;&#x5E38;&#x4F1A;&#x9700;&#x8981;&#x5904;&#x7406;&#x4EE3;&#x7801;&#x51B2;&#x7A81;&#x3001;&#x67E5;&#x770B;&#x7248;&#x672C;&#x5386;&#x53F2;&#x3001;&#x56DE;&#x9000;&#x4EE3;&#x7801;&#x7248;&#x672C;&#x7B49;&#xFF1B;&#x53E6;&#x5916;&#xFF0C;Git &#x5C5E;&#x4E8E;&#x5206;&#x5E03;&#x5F0F; VCS&#xFF0C;&#x5B83;&#x7684;&#x6982;&#x5FF5;&#x4E5F;&#x6BD4;&#x4E2D;&#x592E;&#x5F0F; VCS &#x8981;&#x590D;&#x6742;&#x4E00;&#x4E9B;&#x3002;&#x4F46;&#x8FD9;&#x4E9B;&#x6982;&#x5FF5;&#x4F60;&#x9700;&#x8981;&#x4E00;&#x6B65;&#x6B65;&#x5730;&#x7406;&#x89E3;&#x548C;&#x5438;&#x6536;&#xFF0C;&#x4F60;&#x73B0;&#x5728;&#x53EA;&#x9700;&#x8981;&#x5148;&#x77E5;&#x9053;&#x4E2D;&#x592E;&#x5F0F; VCS &#x7684;&#x8FD9;&#x4E2A;&#x57FA;&#x672C;&#x5DE5;&#x4F5C;&#x6A21;&#x578B;&#xFF0C;&#x5176;&#x4ED6;&#x7684;&#x5185;&#x5BB9;&#x6211;&#x4F1A;&#x5728;&#x540E;&#x9762;&#x6162;&#x6162;&#x5730;&#x5168;&#x90E8;&#x8BB2;&#x6E05;&#x695A;&#x3002;</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="./" class="navigation navigation-prev " aria-label="Previous page: 前言">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="什么是分布式版本控制系统DVCS.html" class="navigation navigation-next " aria-label="Next page: 什么是分布式版本控制系统（DVCS）">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"什么是版本控制系统（VCS）","level":"1.2","depth":1,"next":{"title":"什么是分布式版本控制系统（DVCS）","level":"1.3","depth":1,"path":"什么是分布式版本控制系统DVCS.md","ref":"什么是分布式版本控制系统DVCS.md","articles":[]},"previous":{"title":"前言","level":"1.1","depth":1,"path":"README.md","ref":"README.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":[],"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"什么是版本控制系统VCS.md","mtime":"2018-12-08T13:26:21.863Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2018-12-08T14:41:17.869Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

